# This file was created by the command:
# steps/nnet3/xconfig_to_configs.py --xconfig-file exp/nnet3/tdnn_lstm1c_sp/configs/network.xconfig --config-dir exp/nnet3/tdnn_lstm1c_sp/configs/
# It contains the input of the network and is used in
# accumulating stats for an LDA-like transform of the
# input features.

input-node name=ivector dim=100
input-node name=input dim=40
component name=lda.delayed type=NoOpComponent dim=300
component-node name=lda.delayed component=lda.delayed input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2), ReplaceIndex(ivector, t, 0))
output-node name=output input=Offset(lda.delayed, 5)
